app/Controllers/StudentController.php

        }

        $student = new StudentModel();
        $student->save($data);
---
INSERT INTO `student` (`first_name`, `last_name`, `email`, `phone`) VALUES ('Somnath', 'name', 'test@email.com', '')

    public function index()
    {
        $students = new StudentModel();
        $data = $students->findAll();
---
SELECT *
FROM `student`

    public function delete($id)
    {
        $id = base64_decode($id);
        $student = new StudentModel();
        $data = $student->find($id);

        if ($data['image']) {
            $file_path = FCPATH . 'public\uploads\\' . $data['image'];
            unlink($file_path); // Delete the file
        }
        $student->delete($id);
---
SELECT *
FROM `student`
WHERE `student`.`id` = '8'
DELETE FROM `student`
WHERE `id` IN ('8')